import { deepFreeze } from '@helpers/object'

export default deepFreeze({
  200: 'درخواست با موفقیت انجام شد',
  201: 'درخواست شما با مموفقیت ثبت شد',
  202: 'درخواست شما ثبت شد و در حال بررسی می باشد',
  204: 'موردی یافت نشد',

  400: 'مدل ارسال شده نامعتبر است',
  401: 'توکن ورود شما نامعتبر است',
  403: 'شما اجازه دسترسی به این صفحه را ندارید',
  404: 'موردی یافت نشد!',
  405: 'شما اجازه این عملیات را ندارید',
  406: 'درخواست فرستاده شده قابل قبول نیست',
  408: 'پاسخی از سرور دریافت نشد',

  500: 'اوه، متاسفانه مشکلی پیش آمده است!',
  501: 'سرور پشتیبانی نمی کند از چیزی که ارسال شده است',
  503: 'سرور از دسترسی خارج شده است'
})
